app/controllers/api/v1/lessons_controller.rb

      def show
        @lesson = Lesson.find(params[:id])
        @lesson.flashcards = LessonBuilder.new(@lesson.topic).create_flashcards
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "flashcards" ("lesson_id", "shutter_speed", "aperture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["lesson_id", 1], ["shutter_speed", 1], ["aperture", 2], ["created_at", "2016-06-16 13:58:49.686760"], ["updated_at", "2016-06-16 13:58:49.686760"]]